In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2004_1102/write-in_2004.htm')

In [6]:
df[0].head()

,0,1,2,3,4,5,6,7,8
0,NaN,Lawson Bone,David Byrne,David Cobb,John J. Kennedy,Ralph Nader,James Pace,Michael Peroutka,Tom Tancredo
1,Appling,0,0,0,0,1,0,0,0
2,Atkinson,0,0,0,0,0,0,0,0
3,Bacon,0,0,0,0,2,0,0,0
4,Baker,0,0,0,0,0,0,0,0

In [7]:
len(df)

3

In [ ]:
melted = pd.melt(df, id_vars=["Nan"], var_name="Person", value_name="Score")